# ===============================================
# [ variables.tf ]
#   - Terraform 에서 사용할 입력 변수 정의
#   - 실제 값은 terraform.tfvars 에서 전달
#   - 설정값을 직접 하드코딩 않고 변수로 분리
# ===============================================


# -----------------------------------------------
# [클러스터 접속]
# -----------------------------------------------
variable "kubeconfig_path" {
  description = "kubeconfig 파일 경로"
  type        = string
}

# -----------------------------------------------
# [차트 버전]
# -----------------------------------------------
variable "metallb_chart_version" {
  description = "metallb 차트 버전"
  type        = string
}

# -----------------------------------------------
# [네임스페이스]
# -----------------------------------------------
variable "namespace" {
  description = "MetalLB 네임스페이스"
  type        = string
}
